In [1]:
#import the libraries
import pandas as pd
import scipy 
import numpy as np
from scipy import stats

# Que.1
#A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units.
#A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% 
#significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [3]:
cut= pd.read_csv('E:DATA SETS/Cutlets.csv')

In [4]:
cut.head(10)

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522
5  7.3871  6.8110
6  6.8755  7.2212
7  7.0621  6.6606
8  6.6840  7.2402
9  6.8236  7.0503

In [5]:
cut.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Unit A  35 non-null     float64
 1   Unit B  35 non-null     float64
dtypes: float64(2)
memory usage: 688.0 bytes

In [6]:
unit_a=pd.Series(cut.iloc[:,0])
unit_a.head()

0    6.8090
1    6.4376
2    6.9157
3    7.3012
4    7.4488
Name: Unit A, dtype: float64

In [7]:
unit_b=pd.Series(cut.iloc[:,1])
unit_b.head()

0    6.7703
1    7.5093
2    6.7300
3    6.7878
4    7.1522
Name: Unit B, dtype: float64

In [8]:
p_value=stats.ttest_ind(unit_a,unit_b)
p_value

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

# Que.2
# #A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the 
#laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. 
#TAT is defined as sample collected to report dispatch.

In [10]:
lab=pd.read_csv('E:DATA SETS/LabTAT.csv')
lab.head(15)

    Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0         185.35        165.53        176.70        166.13
1         170.49        185.91        198.45        160.79
2         192.77        194.92        201.23        185.18
3         177.33        183.00        199.61        176.42
4         193.41        169.57        204.63        152.60
5         179.45        197.00        181.51        161.12
6         191.37        166.36        214.21        154.02
7         166.81        169.60        183.43        163.25
8         158.81        175.36        191.60        152.79
9         165.88        198.68        208.43        161.98
10        174.75        189.12        231.00        171.22
11        193.37        140.55        198.37        183.67
12        184.75        160.44        226.62        142.95
13        178.54        167.03        214.44        152.37
14        180.19        182.67        159.69        163.81

In [11]:
lab_1=pd.Series(lab.iloc[:,0])
lab_1.head()

0    185.35
1    170.49
2    192.77
3    177.33
4    193.41
Name: Laboratory 1, dtype: float64

In [12]:
lab_2=pd.Series(lab.iloc[:,1])
lab_2.head()

0    165.53
1    185.91
2    194.92
3    183.00
4    169.57
Name: Laboratory 2, dtype: float64

In [13]:
lab_3=pd.Series(lab.iloc[:,2])
lab_4=pd.Series(lab.iloc[:,3])

In [14]:
p_value=stats.f_oneway(lab_1,lab_2,lab_3,lab_4)
p_value

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

# Que3
#Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar 
#across regions.

In [16]:
sale=pd.read_csv('E:DATA SETS/BuyerRatio.csv')
sale.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [20]:
sale.drop(columns= 'Observed Values',inplace=True)

In [21]:
sale

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [23]:
males=pd.Series(sale.iloc[0,:])
males

East      50
West     142
North    131
South     70
Name: 0, dtype: int64

In [25]:
females=pd.Series(sale.iloc[1,:])
females

East      435
West     1523
North    1356
South     750
Name: 1, dtype: int64

In [26]:
p_values=stats.ttest_ind(males,females)
p_values

Ttest_indResult(statistic=-3.5834877367684856, pvalue=0.011594334372357056)

In [29]:
#comparing with alpha i.e. 0.05 
if p_values[1]<0.05:
    print("Not all Proportions are equal")
else:
    print("All proportions are equal")

Not all Proportions are equal

###Que4
#TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order 
#forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check 
#whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw 
#appropriate inferences.

In [33]:
data=pd.read_csv('E:DATA SETS/Costomer+OrderForm.csv')
data.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [34]:
data.tail()

    Phillippines   Indonesia       Malta       India
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

In [36]:
print(data['Phillippines'].value_counts(),data['Indonesia'].value_counts(),data['Malta'].value_counts(),data['Malta'].value_counts())

Error Free    271
Defective      29
Name: Phillippines, dtype: int64 Error Free    267
Defective      33
Name: Indonesia, dtype: int64 Error Free    269
Defective      31
Name: Malta, dtype: int64 Error Free    269
Defective      31
Name: Malta, dtype: int64

In [37]:
values=(([271,267,269,269],[29,33,31,31]))

In [38]:
from scipy.stats import chi2_contingency

In [44]:
 g,p,dof, expctd=chi2_contingency(values,lambda_="log-likelihood")

In [45]:
g

0.2879838907973058

In [46]:
p

0.9622723144902159

In [47]:
chi2_contingency(values,lambda_="log-likelihood")

(0.2879838907973058,
 0.9622723144902159,
 3,
 array([[269., 269., 269., 269.],
        [ 31.,  31.,  31.,  31.]]))

In [51]:
print('significance=0.05, p=%.3f' % (p))
if p <= 0.05:
    print('Dependent (reject H0)')
else:
    print('Independent (fail to reject H0)')

significance=0.05, p=0.962
Independent (fail to reject H0)

### THE END